# 1 - 什么是eBPF，为何它如此重要？
eBPF大概可以认为是给内核提供的一段代码，它可以被关联到一个事件上，当这个事件发生时，这段代码就会被执行。eBPF有自己的一套语法，内核会处理好这段代码并验证它的安全性，只有安全的代码才会被接受。这意味着eBPF不会导致机器崩溃或陷入死循环，并且不会允许数据被泄露。

## eBPF的动态加载
eBPF几乎是热插拔的，添加eBPF程序以后无需重启内核就可以生效。

## eBPF程序的高性能
eBPF会被即时编译成本地机器码，并且它直接在内核中运行，不需要用户态和内核态之间的交互，从而获得了非常高的性能。通过eBPF在内核态先处理一些数据，可以避免一些数据被传递到用户态，从而提高性能。

## 云原生环境中的eBPF
云服务器往往采用云原生的方式组织，使用容器、Kubernetes或ECS等编排工具，或者像Lambda、云函数、Fargate等无服务器方法。它们往往自动进行负载均衡，在无服务器环境中，甚至不知道每个工作负载在哪个服务器上运行。

然而使用eBPF可以实现：
- 无需修改应用程序就可以用eBPF监控应用程序
- 无需重启服务器就可以用eBPF观察应用进程

相比之下Sidecar模型把监控工具作为一个容器运行，并向Kubernetes Pod注入它们，这比直接修改应用程序要方便。然而也有一些缺点：
- 添加Sidecar需要重启应用程序Pod
- 需要对应用程序的YAML修改，一般这是自动完成的，不过一旦有问题添加Sidecar就会失败
- 注入Sidecar会显著增加Pod的启动时间，并且可能向程序引入竞争条件或其他不确定问题
- 如果使用Sidecar来实现网络功能，那么流量需要先在内核中绕一圈，然后再到达Sidecar，这会降低性能，如下图

![Sidecar](image/Sidecar.png)

# 2 - eBPF的Hello World

## BCC的Hello World
此程序使用BCC的Python库编写：
```python
#!/usr/bin/python3
from bcc import BPF

# eBPF程序，使用C语言编写，调用辅助函数bpf_trace_printk()打印消息
program = r"""
int hello(void *ctx) {
    bpf_trace_printk("Hello World!");
    return 0;
}
"""

# 创建BPF对象，传入eBPF程序，它会自动编译并加载到内核中
b = BPF(text=program)

# 为了把eBPF附加到系统调用execve()上，先查询该系统调用
syscall = b.get_syscall_fnname("execve")

# 使用内核探针kprobe，把hello程序附加到该事件上
b.attach_kprobe(event=syscall, fn_name="hello")

# 读取内核输出的消息并打印
b.trace_print()
```
实际上 `bpf_trace_printk()` 把输出写入一个伪文件 `/sys/kernel/debug/tracing/trace_pipe` 中，然后程序从中取出输出信息。可以使用 `cat` 查看它的内容，这需要root权限。

## 运行Hello World

config=PERF_COUNT_SW_BPF_OUTPUT, ...}, -1, X, -1, PERF_FLAG_FD_CLOEXEC) = Y
ioctl(Y, PERF_EVENT_IOC_ENABLE, 0) = 0
bpf(BPF_MAP_UPDATE_ELEM, {map_fd=4, key=0xffffa7842490, value=0xffffa7a2b410, flags=BPF_ANY}, 128) = 0
```
其中 `X` 在四次调用中分别是 0、1、2 和 3，这是因为作者的电脑有 4 个 CPU 核心，因此 output perf 缓冲区也有 4 个条目，实际上是每个 CPU 核心有一个条目。这也就是为什么创建 perf 缓冲区的时候指定的类型为 `BPF_MAP_TYPE_PERF_EVENT_ARRAY`，因为每个 CPU 核心都有一个 perf 缓冲区，它们一起形成的数组。

每个缓冲区打开时都返回一个文件描述符，即上面的 `Y` ，这里分别是 8、9、10 和 11。然后 `ioctl()` 用于启用 perf 输出。最后 `bpf()` 系统调用把缓冲区加入数组中。

用户空间代码会在 4 个描述符上调用 `ppoll()` 来检查是否有数据到达：
```shell
ppoll([{fd=8, events=POLLIN}, {fd=9, events=POLLIN}, {fd=10, events=POLLIN},
{fd=11, events=POLLIN}], 4, NULL, NULL, 0) = 1 ([{fd=8, revents=POLLIN}])
```
这个调用会阻塞直至数据到达。

## 环形缓冲区
在内核版本 5.8 以后，使用 BPF 环形缓冲区比使用 perf 缓冲区更好，一方面是性能原因，另一方面它可以保留数据的提交顺序，即使数据来自不同的 CPU 核心。它只有一个缓冲区，所有核心共享。

使用环形缓冲区的版本和 perf 缓冲区的版本非常相似，它们的区别为：
| hello-buffer-config.py                        | hello-ring-buffer-config.py                    |
| --------------------------------------------- | ---------------------------------------------- |
| BPF_PERF_OUTPUT(output);                      | BPF_RINGBUF_OUTPUT(output, 1);                 |
| output.perf_submit(ctx, &data, sizeof(data)); | output.ringbuf_output(&data, sizeof(data), 0); |
| b["output"].open_perf_buffer(print_event)     | b["output"].open_ring_buffer(print_event)      |
| b.perf_buffer_poll()                          | b.ring_buffer_poll()                           |

创建环形缓冲区的系统调用如下：
```shell
bpf(BPF_MAP_CREATE, {map_type=BPF_MAP_TYPE_RINGBUF, key_size=0, value_size=0,
max_entries=4096, ... map_name="output", ...}, 128) = 4
```
而等待数据到达则使用了较新的 `epoll`：
```shell
# 创建 epoll 文件描述符
epoll_create1(EPOLL_CLOEXEC) = 8

# 添加环形缓冲区文件描述符到 epoll
epoll_ctl(8, EPOLL_CTL_ADD, 4, {events=EPOLLIN, data={u32=0, u64=0}}) = 0

# 等待数据到达
epoll_pwait(8, [{events=EPOLLIN, data={u32=0, u64=0}}], 1, -1, NULL, 8) = 1
```

## 从map中读取数据
查看这个过程使用的系统调用：
```shell
$ strace -e bpf bpftool map dump name config
```
可以发现，有两个步骤：
1. 遍历所有 map，查找名为 `config` 的 map
1. 如果找到了，就遍历其中所有元素

### 找到map
```shell
# BPF_MAP_GET_NEXT_ID 获取 start_id 中指定值之后的下一个 map 的 ID。
bpf(BPF_MAP_GET_NEXT_ID, {start_id=0,...}, 12) = 0

# BPF_MAP_GET_FD_BY_ID 返回指定 map ID 的文件描述符。
bpf(BPF_MAP_GET_FD_BY_ID, {map_id=48...}, 12) = 3

# BPF_OBJ_GET_INFO_BY_FD 检索文件描述符所引用对象的信息。其中包括名称，可以用于检查是否正在查找的 map
bpf(BPF_OBJ_GET_INFO_BY_FD, {info={bpf_fd=3, ...}}, 16) = 0

# 重复该序列，获取步骤 1 中 map 之后下一张 map ID。
bpf(BPF_MAP_GET_NEXT_ID, {start_id=48, ...}, 12) = 0
bpf(BPF_MAP_GET_FD_BY_ID, {map_id=116, ...}, 12) = 3
bpf(BPF_OBJ_GET_INFO_BY_FD, {info={bpf_fd=3...}}, 16) = 0
```
如果遍历完了所有的 map，会遇到：
```shell
bpf(BPF_MAP_GET_NEXT_ID, {start_id=133,...}, 12) = -1 ENOENT (No such file or directory)
```

### 读取map中的元素
通过遍历 map 获得了对应的文件描述符，接下来就是读取 map 中的元素：
```shell
# BPF_MAP_GET_NEXT_KEY 返回 key 的下一个 key，如果传入 NULL，则返回第一个 key。结果写入 next_key
bpf(BPF_MAP_GET_NEXT_KEY, {map_fd=3, key=NULL, next_key=0xaaaaf7a63960}, 24) = 0

# 给定一个键，返回对应的值，写入 value 的位置
bpf(BPF_MAP_LOOKUP_ELEM, {map_fd=3, key=0xaaaaf7a63960,
value=0xaaaaf7a63980, flags=BPF_ANY}, 32) = 0

# 此时，bpftool获得了第一个键值对的内容，并将该信息写入屏幕。
[{
    "key": 0,
    "value": {
        "message": "Hey root!"
    }

# 移动到下一个键，获取它的值，并将这个键值对写到屏幕上
bpf(BPF_MAP_GET_NEXT_KEY, {map_fd=3, key=0xaaaaf7a63960,
next_key=0xaaaaf7a63960}, 24) = 0
bpf(BPF_MAP_LOOKUP_ELEM, {map_fd=3, key=0xaaaaf7a63960,
value=0xaaaaf7a63980, flags=BPF_ANY}, 32) = 0
    },{
        "key": 501,
        "value": {
            "message": "Hi user 501!"
        }

# 下一次调用 BPF_MAP_GET_NEXT_KEY 返回 ENOENT，表示 map 中没有更多的条目
bpf(BPF_MAP_GET_NEXT_KEY, {map_fd=3, key=0xaaaaf7a63960,
next_key=0xaaaaf7a63960}, 24) = -1 ENOENT (No such file or directory)

# 此处，bpftool 完成写入屏幕的输出并退出。
    }
]
+++ exited with 0 +++
```

<br><br>

# 5 - CO-RE、BTF 和 Libbpf
BTF 是 BPF Type Format 的缩写，即 BPF 类型格式。它可以让 BPF 一次编译、到处运行（CO-RE），解决了 eBPF 程序在不同内核版本间的可移植问题。

许多 eBPF 程序需要访问内核中的数据结构，然而随着内核的迭代其中的数据结构也会发生变化，从而带来了兼容性问题。CO-RE 允许 eBPF 程序包含编译时的数据结构信息，同时提供机制在必要时调整字段的访问方式，从而保证只要程序不访问目标机器内核中不存在的字段或数据结构，就可以在不同内核版本之间移植。

## BCC 的可移植性方法
BCC 解决跨内核移植问题的办法是，运行时在目标计算机重新编译 eBPF 程序。这样有许多问题：
- 需要在目标机器上安装编译工具链和头文件
- 每次可能需要几秒钟来编译程序
- 如果大量的机器都是相同的，重复编译是浪费的
- 嵌入式设备可能没有足够的资源来编译程序

因为这样，BCC 并不是开发现代 eBPF 程序的最佳工具。（在 BCC 的 libbpf-tools 目录中有用 C 语言编写的更新版本的工具，它们使用了 libbpf 和 CO-RE，从而避免了这些问题）

## CO-RE 概述
CO-RE 的组成要素如下:
- BTF：表达数据结构和函数签名布局的格式，被用来检查编译时和运行时数据结构的差异，也被 bpftool 等工具用来按可读方式打印数据，从内核 5.4 开始被支持
- 内核头：内核源代码中描述数据结构的头文件，在不同版本的内核中可能有所不同。eBPF 程序员可以直接包含内核的头文件，或使用 bpftool 从当前内核中生成的 vmlinux.h 头文件，它包含了 BPF 程序可能用到的所有数据结构
- 编译器支持：Clang 编译器在使用 `-g` 编译选项的时候会包含 CO-RE 信息，GCC 也在版本 12 加入了对 CO-RE 的支持
- 支持数据结构体重定位的库：运行时，由于字段的偏移量可能会发生变化，需要调整字节码进行补偿。有几个库可以做到这一点：libbpf 是该功能的原始 C 库，Cilium 为 Go 提供了一个库，Aya 为 Rust 提供了一个库
- BPF 框架：这是可选的。可以从编译的 BPF 对象文件自动生成一个框架，提供一些便捷函数供用户空间程序使用，用于管理 BPF 程序的生命周期（加载、附加到事件、卸载等），相较于直接使用 libbpf 这样的底层库更方便

## BPF 类型格式
BTF 信息描述数据结构和代码在内存中的布局方式。

### BTF 用例
BTF 具有许多用途：
- 在程序加载到内核的时候，根据数据结构的不同进行适当的调整
- 用于调试时按可读方式打印数据
- 包含行和函数信息，让 bpftool 在编译后的程序转储的输出中交错显示源代码
- BPF 自旋锁也用到了 BTF 信息，自旋锁用于阻止两个 CPU 核心访问相同的 map 值。eBPF 程序使用辅助函数 `bpf_spin_lock()` 和 `bpf_spin_unlock()` 来操作自旋锁，只有当 BTF 信息中包含了自旋锁在结构体中的位置时，这两个函数才能正确工作。自旋锁在内核 5.1 版本被支持，只能用于哈希或数组 map 类型。

### 使用 bpftool 列出 BTF 信息
在运行上一章中的 hello-buffer-config 时测试，以下命令列出加载到内核的所有 BTF 信息：
```shell
$ bpftool btf list
1: name [vmlinux] size 5843164B
2: name [aes_ce_cipher] size 407B
3: name [cryptd] size 3372B
...
149: name <anon> size 4372B prog_ids 319 map_ids 103
        pids hello-buffer-co(7660)
155: name <anon> size 37100B
        pids bpftool(7784)
```
第一个条目是 vmlinux，保存当前内核相关的 BTF 信息。

注意到条目 149，它包含的信息为：
- 这个 BTF 信息的 ID 是 149
- 这是一个大约 4KB 的匿名信息块
- 它被 ID 319 的 BPF 程序和 ID 103 的 map 使用
- 它被 ID 7660 的 hello-buffer-config 程序使用（名字被截断为 15 个字符）

### BTF 类型
得到 BTF 信息的 ID 以后，可以通过 bpftool 来检查其中的内容。作者检查 ID 149 中的信息时得到了 69 行输出，每行都是一个类型定义。这里查看前几行作为示例，它们与 config map 的定义相关，首先回看源代码中的定义：
```c
struct user_msg_t {
    char message[12];
};
BPF_HASH(config, u32, struct user_msg_t);
```
然后看看 BTF 信息中对应的信息的前三行：
```shell
$ bpftool btf dump id 149
[1] TYPEDEF 'u32' type_id=2
[2] TYPEDEF '__u32' type_id=3
[3] INT 'unsigned int' size=4 bits_offset=0 nr_bits=32 encoding=(none)
...
```
每行开头的数字是类型 ID，因此这里包含了三种类型的信息：
- 类型 1：名为 `u32` 的别名，具体的类型由类型 2 定义
- 类型 2：名为 `__u32` 的别名，具体的类型由类型 3 定义
- 类型 3：名为 `unsigned int` 的整型，即 4 字节的无符号整数

因此 `u32` 实际上就是 `unsigned int` 的别名。

然后再看接下来几行：
```shell
[4] STRUCT 'user_msg_t' size=12 vlen=1
        'message' type_id=6 bits_offset=0
[5] INT 'char' size=1 bits_offset=0 nr_bits=8 encoding=(none)
[6] ARRAY '(anon)' type_id=5 index_type_id=7 nr_elems=12
[7] INT '__ARRAY_SIZE_TYPE__' size=4 bits_offset=0 nr_bits=32 encoding=(none)
```
这些就与 `user_msg_t` 结构体相关：
- 类型 4：名为 `user_msg_t` 的结构体，大小为 12 字节，总共有一个字段。然后依次列出其中的字段，这里只有一个 `message` 字段，类型为类型 6。
- 类型 5：名为 `char` 的整型，即 C 语言中的 `char` 类型
- 类型 6：匿名的数组类型，包含的元素类型是类型 5，有 12 个元素
- 类型 7：一个 4 字节的整型，用于表示数组的大小

目前所有条目的 bits_offset 都是 0，在具有多个字段的结构体中，这个值会有所不同：
```shell
[8] STRUCT '____btf_map_config' size=16 vlen=2
        'key' type_id=1 bits_offset=0
        'value' type_id=4 bits_offset=32
```
这是由 BCC 自动生成的，名为 config 的 map 的键值对类型，可以看到 `value` 是从 32 位开始的。

之所以需要有 bits_offset，是因为可能编译器会对字段进行对齐处理，这样的处理在不同的编译器和架构上可能会有所不同。

### 带有 BTF 信息的 map
看看创建一个 map 的时候如何把 BTF 信息传递给内核，上一章提到 map 的创建是通过系统调用 `bpf(BPF_MAP_CREATE)` 来完成的，这需要传递一个 `bpf_attr` 结构体作为参数，内核中它的定义如下（省略一些细节）：
```c
struct { /* anonymous struct used by BPF_MAP_CREATE command */
    __u32    map_type;    /* one of enum bpf_map_type */
    __u32    key_size;    /* size of key in bytes */
    __u32    value_size;    /* size of value in bytes */
    __u32    max_entries;    /* max number of entries in a map */
    ...
    char    map_name[BPF_OBJ_NAME_LEN];
    ...
    __u32    btf_fd;        /* fd pointing to a BTF type data */
    __u32    btf_key_type_id;    /* BTF type_id of the key */
    __u32    btf_value_type_id;    /* BTF type_id of the value */
    ...
};
```
在引入 BTF 之前，这个结构体中没有 btf 相关字段，内核知道 key 和 value 的大小，但不知道它们的具体类型。这里把 key 和 value 的类型都单独传递给了内核，因此上面看到的 btf_map_config 结构体并未被内核使用，它只是提供给用户空间程序使用的。

### 函数和函数原型的 BTF 数据
以下是 `hello()` 的相关信息：
```shell
[31] FUNC_PROTO '(anon)' ret_type_id=23 vlen=1
        'ctx' type_id=10
[32] FUNC 'hello' type_id=31 linkage=static
```
这里有两个类型：
- 类型 32：名为 `hello` 的函数，它的类型是类型 31
- 类型 31：一个函数原型，它有 1 个参数。参数 `ctx`，类型是类型 10；返回类型是类型 23

用到的两个类型是：
```shell
[10] PTR '(anon)' type_id=0
...
[23] INT 'int' size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
```
其中类型 10 是一个匿名指针，默认类型为 0（没有被列出，实际上是 `void *`）。类型 23 是一个 4 字节整数，encoding=SIGNED 表示它是有符号整数。

### 检查 map 和程序的 BTF 数据
查看 config map 的 BTF 数据：
```shell
bpftool btf dump map name config
[1] TYPEDEF 'u32' type_id=2
[4] STRUCT 'user_msg_t' size=12 vlen=1
    'message' type_id=6 bits_offset=0
```
类似的，可以使用 `bpftool btf dump prog <program_name>` 来查看某个程序相关的 BTF 数据。

## 生成内核头文件
查看内核中的所有 BTF 数据块时，会发现有许多预先存在的块，如：
```shell
$ bpftool btf list
1: name [vmlinux] size 5842973B
2: name [aes_ce_cipher] size 407B
3: name [cryptd] size 3372B
...
```
第一项是 vmlinux，它包含了当前内核的所有数据类型、数据结构和函数定义的 BTF 信息，这要求内核使用 CONFIG_DEBUG_INFO_BTF 选项编译。

eBPF 程序需要了解它需要使用的内核数据结构和类型的定义，在 CO-RE 之前，开发人员甚至需要知道它们在哪个具体的头文件中。不过现在支持 BTF 的工具可以从内核包含的 BTF 信息中生成一个合适的头文件。

这个头文件一般是 vmlinux.h，可以通过以下命令生成：
```shell
$ bpftool btf dump file /sys/kernel/btf/vmlinux format c > vmlinux.h
```
该文件定义了所有内核数据类型，因此 eBPF 程序只需要包含这个头文件就可以了。当把程序编译为目标文件后，其中将会包含与头文件中定义相匹配的 BTF 信息。

自内核 5.4 版本以来，/sys/kernel/btf/vmlinux 文件包含了 BTF 信息。如果希望在更早的机器上使用相关特性，需要自行为 libbpf 准备原始 BTF 数据。

## CO-RE eBPF 程序
假设使用 C 语言编写 eBPF 程序并使用 Clang 编译器和 libbpf 库实现。实现一个非常类似于上一章中的 `hello-buffer-config.py` 的程序，不过这里用 C 语言实现，从而可以使用 libbpf 和 CO-RE。

首先来实现程序的 eBPF 部分 hello-buffer-config.bpf.c，然后再实现用户空间部分 hello-buffer-config.c。

### 头文件
eBPF 程序需要包含一些头文件：
```c
#include "vmlinux.h"
#include <bpf/bpf_helpers.h>
#include <bpf/bpf_tracing.h>
#include <bpf/bpf_core_read.h>
#include "hello-buffer-config.h"
```
这基本是 libbpf 程序的典型模式。

#### 内核头信息
引用任何内核数据结构或类型的程序，最简单的选择就是包含 vmlinux.h 头文件。更复杂些的是引用内核中单独的头文件，或者干脆自行定义类型。如果需要用到 libbpf 提供的辅助函数，就需要包含 vmliunx.h 或者 linux/types.h 来获取 BPF辅助函数所使用的 u32 和 u64 等类型。

vmlinux.h 是从内核头文件提取出来的，但它并不包含 #define 定义的常量值。比如网络程序可能定义了一组常量来表示协议类型，而 vmlinux.h 就不包含它们，则可能需要在自己的代码中处理。

#### 来自 libbpf 的头文件
如果需要使用 BPF 辅助函数，就要包含 libbpf 中相关的头文件。

实际上经常会把 libbpf 作为一个子模块，然后从源代码构建/安装它，这需要在 libbpf/src 目录下运行 `make install` 。

#### 用于应用程序的头文件
用于在 eBPF 程序和用户空间程序之间共享数据结构的头文件。这里定义了传输的数据的结构：
```c
struct data_t {
   int pid;
   int uid;
   char command[16];
   char message[12];
   char path[16];
};
```

### 定义 map
包含头文件以后，接下来的几行定义了 map 的结构体：
```c
struct {
    __uint(type, BPF_MAP_TYPE_PERF_EVENT_ARRAY);
    __uint(key_size, sizeof(u32));
    __uint(value_size, sizeof(u32));
} output SEC(".maps");

struct user_msg_t {
   char message[12];
};

struct {
    __uint(type, BPF_MAP_TYPE_HASH);
    __uint(max_entries, 10240);
    __type(key, u32);
    __type(value, struct user_msg_t);
} my_config SEC(".maps");
```
在 BCC 中，这只有一行：
```c
BPF_HASH(config, u32, struct user_msg_t);
```
然而不使用 BCC 时这个宏并不可用，所以需要自行手写。其中用到了几个宏，它们定义在 bpf/bpf_helpers_def.h 中：
```c
#define __uint(name, val) int (*name)[val]
#define __type(name, val) typeof(val) *name
#define __array(name, val) typeof(val) *name[]
```

### eBPF 程序节
libbpf 要求每个 eBPF 程序都使用 `SEC()` 宏来定义程序类型，如：
```c
SEC("kprobe")
```
这会在 ELF 目标文件中产生一个 kprobe 节，从而 libbpf 知道把该程序加载为 BPF_PROG_TYPE_KPROBE 类型。实际上还可以把类型定义地更细致：
```c
SEC("kprobe/__arm64_sys_execve")
```
这样 libbpf 就知道把这个程序附加到哪个事件上，从而不需要在用户空间程序中手工附加。不过开发人员需要知道当前架构上的系统调用名称（可以通过 /proc/kallsyms 查看，它列出了所有的内核符号）。而 libbpf 提供了一个 ksyscall 节来简化开发，它让加载程序自动附加到特定架构版本的 kprobe 上：
```c
SEC("ksyscall/execve")
```

然后是程序本身：
```c
SEC("ksyscall/execve")
// libbpf 中的 BPF_KPROBE_SYSCALL 宏，可以通过名称方便地访问传给系统调用的参数。对于 execve()，第一个参数是要执行的程序的路径名，这里被命名为 pathname。
int BPF_KPROBE_SYSCALL(hello, const char *pathname)
{
   struct data_t data = {};
   struct user_msg_t *p;

   data.pid = bpf_get_current_pid_tgid() >> 32;
   data.uid = bpf_get_current_uid_gid() & 0xFFFFFFFF;

   bpf_get_current_comm(&data.command, sizeof(data.command));
   // 复制内存需要使用 BPF 辅助函数
   bpf_probe_read_user_str(&data.path, sizeof(data.path), pathname);

   // bpf_map_lookup_elem() 是 BPF 辅助函数，在 map 中查找键对应的值
   // BCC 中使用 p = my_config.lookup(&data.uid)，在编译前也会重写成 bpf_map_lookup_elem() 调用
   p = bpf_map_lookup_elem(&my_config, &data.uid);
   if (p != 0) {
      bpf_probe_read_kernel_str(&data.message, sizeof(data.message), p->message);
   } else {
      bpf_probe_read_kernel_str(&data.message, sizeof(data.message), message);
   }

   // BCC 中为 output.perf_submit(ctx, &data, sizeof(data))
   bpf_perf_event_output(ctx, &output, BPF_F_CURRENT_CPU, &data, sizeof(data));

   return 0;
}
```
由于 BCC 不支持全局变量， `message` 需要定义在 `hello()` 中成为局部变量。而使用 libbpf 时就可以把它定义成全局变量。

